grouper-ws/grouper-ws/docs/addMemberSoapRequest.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope
	xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
	<soapenv:Body>
		<ns1:addMember
			xmlns:ns1="http://webservices.grouper.middleware.internet2.edu/xsd">
			<ns1:wsGroupLookup>
				<ns1:groupName>aStem:aGroup</ns1:groupName>
			</ns1:wsGroupLookup>
			<ns1:subjectLookups>
				<ns1:subjectId>10021368</ns1:subjectId>
			</ns1:subjectLookups>
			<ns1:subjectLookups>
				<ns1:subjectId>10039438</ns1:subjectId>
			</ns1:subjectLookups>
			<ns1:replaceAllExisting>F</ns1:replaceAllExisting>
			<ns1:actAsSubjectLookup>
				<ns1:subjectId>GrouperSystem</ns1:subjectId>
			</ns1:actAsSubjectLookup>
		</ns1:addMember>
	</soapenv:Body>
</soapenv:Envelope>